In [1]:
import numpy as np
import pandas as pd
import tensorflow as tf

In [2]:
# Check for TensorFlow GPU access
print(f"TensorFlow has access to the following devices:\n{tf.config.list_physical_devices()}")

# See TensorFlow version
print(f"TensorFlow version: {tf.__version__}")

TensorFlow has access to the following devices:
[PhysicalDevice(name='/physical_device:CPU:0', device_type='CPU'), PhysicalDevice(name='/physical_device:GPU:0', device_type='GPU')]
TensorFlow version: 2.8.0

In [3]:
df = pd.read_csv('data/train.csv')

In [4]:
# Inspecting the data
df.shape

(891, 12)

In [5]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [7]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [8]:
# Empty check
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [9]:
empty = df.isnull().sum()
total = len(df.index)
for key, val in empty.items():
    print("{} has {}% missing values".format(key, val/total * 100))

PassengerId has 0.0% missing values
Survived has 0.0% missing values
Pclass has 0.0% missing values
Name has 0.0% missing values
Sex has 0.0% missing values
Age has 19.865319865319865% missing values
SibSp has 0.0% missing values
Parch has 0.0% missing values
Ticket has 0.0% missing values
Fare has 0.0% missing values
Cabin has 77.10437710437711% missing values
Embarked has 0.22446689113355783% missing values

In [10]:
# Preprocessing the data
df['Sex'].replace(['female', 'male'], [0, 1], inplace = True)

In [11]:
df.drop('Name', axis = 1, inplace = True)
df.drop('Cabin', axis = 1, inplace = True)

In [12]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Sex              int64
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Embarked        object
dtype: object

In [13]:
df.fillna(0, inplace = True)

In [14]:
empty = df.isnull().sum()
total = len(df.index)
for key, val in empty.items():
    print("{} has {}% missing values".format(key, val/total * 100))

PassengerId has 0.0% missing values
Survived has 0.0% missing values
Pclass has 0.0% missing values
Sex has 0.0% missing values
Age has 0.0% missing values
SibSp has 0.0% missing values
Parch has 0.0% missing values
Ticket has 0.0% missing values
Fare has 0.0% missing values
Embarked has 0.0% missing values

In [15]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Sex              int64
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Embarked        object
dtype: object

In [16]:
df['Embarked'].replace(['C', 'Q', 'S'], [0, 1, 2], inplace = True)

In [17]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Sex              int64
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Embarked         int64
dtype: object

In [18]:
df.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,1,22.0,1,0,A/5 21171,7.2500,2
1,2,1,1,0,38.0,1,0,PC 17599,71.2833,0
2,3,1,3,0,26.0,0,0,STON/O2. 3101282,7.9250,2
3,4,1,1,0,35.0,1,0,113803,53.1000,2
4,5,0,3,1,35.0,0,0,373450,8.0500,2

In [19]:
df.drop('Ticket', axis = 1, inplace = True)

In [20]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Sex              int64
Age            float64
SibSp            int64
Parch            int64
Fare           float64
Embarked         int64
dtype: object

In [21]:
df.head()

   PassengerId  Survived  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0            1         0       3    1  22.0      1      0   7.2500         2
1            2         1       1    0  38.0      1      0  71.2833         0
2            3         1       3    0  26.0      0      0   7.9250         2
3            4         1       1    0  35.0      1      0  53.1000         2
4            5         0       3    1  35.0      0      0   8.0500         2

In [24]:
x = df.drop('Survived', axis = 1).to_numpy()

In [25]:
y = df['Survived'].to_numpy()

In [26]:
from sklearn import svm
clf = svm.SVC(gamma=0.001, C=100.)

In [27]:
clf.fit(x, y)

SVC(C=100.0, gamma=0.001)

In [39]:
clf.predict(x[0])

ValueError: Expected 2D array, got 1D array instead:
array=[ 1.    3.    1.   22.    1.    0.    7.25  2.  ].
Reshape your data either using array.reshape(-1, 1) if your data has a single feature or array.reshape(1, -1) if it contains a single sample.